全局黑暗模式的到来

定位权限变得更重要

现在，当应用第一次开启并需要调用定位权限时，系统就会提供了三种选项，分别为「始终允许」、「仅在使用期间打开」和「拒绝」，你也可以直接在设置项中对定位权限进行调整。

Android Q 在下拉通知栏顶部加入了一项新内容，即剩余续航时间。和电池图标的百分比不同，它会直接告诉你手机还能用多长时间，相当于是将设置项中的「预估使用时长」放到了通知栏上。

分享功能变得更好用了
而在最新的 Android Q 中，Google 加入了一项名为「Sharing Shortcuts」的 API 接口，允许应用提前做好内容加载来提升菜单的响应速度，顶部还会直接显示当前分享的内容，以及可供复制/粘贴的按钮，方便用户二次操作

它能够原生支持 AV1 格式，这是一种新的开源视频解码器，在实现更高压缩比的同时，也能有效提高编码效率；此外它还支持名为 WAP3 和 Enhanced Open 两项新 Wi-Fi 标准，以及 HDR 10+ 标准。

图形接口方面，Android Q 将会继续推行并普及 Vulkan 图形渲染 API，之后还会加入对 ANGLE 抽象层的支持。

Android Q 还加入了对原生录屏和桌面模式的支持
